Autodesk.Revit.DB.Structure.RebarConstrainedHandle.IsCustomHandle
Returns true if the RebarHandleType of the RebarConstrainedHandle is 'CustomHandle'.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.IsEdgeHandle
Returns true if the RebarHandleType of the RebarConstrainedHandle is 'Edge'.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.IsValid
Checks that the RebarConstrainedHandle still has access to valid Rebar handle data
and that its RebarConstraintsManager is still valid.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.GetHandleName
Gets the name of the handle.
Returns:
Returns the name of the handle. In case of handles of CustomHandle type it can return null if the .dll that contains the server is not loaded.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstrainedHandle is no longer valid.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.GetCustomHandleTag
Returns the tag of the handle. The type of the handle should be 'CustomHandle'.
Returns:
Returns the tag of custom handle.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstrainedHandle is no longer valid.
-or-
The RebarConstrainedHandle is not of RebarHandleType 'CustomHandle'.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.GetEdgeNumber
If the RebarConstrainedHandle's RebarHandleType is 'Edge',
then this function will return the number of the edge that is
driven by the handle.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstrainedHandle is no longer valid.
-or-
The RebarConstrainedHandle is not of RebarHandleType 'Edge'.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.GetHandleType
Returns the RebarHandleType of a RebarConstrainedHandle.
Returns:
The RebarHandleType of the specified RebarConstrainedHandle.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstrainedHandle is no longer valid.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstrainedHandle.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstrainedHandle
A class representing a handle on a Rebar that can be joined to a reference, such
as a host Element's surface or cover, or another Rebar's handle.
Remarks:
A rebar element's flexible geometry is controlled by several handles. The shape
of the bar is controlled by a handle at each end of the bar (blue circle controls)
and a handle each edge (blue triangle controls).  Another handle is used to
control the location of the plane in which the rebar lies.  An additional handle
controls the length of a set of rebar.
RebarConstrainedHandles can only be constructed internally by Revit.  They are
available to the API by querying a rebar element's RebarConstraintsManager.
Since:
2014